'use strict'

/*
Реализовать класс RangeValidator
Обьекты, созданные им должны обладать следующими свойcтвами:
from(число) 5
to(число) 50

- Реализовать геттеры и сеттеры для обоих свойств.
- Реализовать getter range, который будет возвращать массив, состоящий из границ диапазона from и to.
- Реализовать метод validate, который будет принимать число и проверить входит ли число в указанный диапазон. 
- Метод возвращает это же число, если оно входит в диапазон. И кинет ошибку, если не входит.

* Bonus tasks:
Создать проверки которые убедятся, что число во from меньше числа to и наоборот.
Создать проверки, которые помогут избежать попадание неправильных типов данных в from и to.
*/

